In [2]:
import pandas as pd
import datetime

In [3]:
# The path to our CSV file
drinks_file = "data/538_alcohol/drinks.csv"
# Read our Kickstarter data into pandas
drinks_original = pd.read_csv(drinks_file)
drinks_original.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9

In [4]:
drinks_df = pd.DataFrame(drinks_original)
drinks_df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
0,Afghanistan,0,0,0,0.0
1,Albania,89,132,54,4.9
2,Algeria,25,0,14,0.7
3,Andorra,245,138,312,12.4
4,Angola,217,57,45,5.9
...,...,...,...,...,...
188,Venezuela,333,100,3,7.7
189,Vietnam,111,2,1,2.0
190,Yemen,6,0,0,0.1
191,Zambia,32,19,4,2.5
192,Zimbabwe,64,18,4,4.7

In [5]:
drinks_df['year'] = 2010
drinks_df

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,year
0,Afghanistan,0,0,0,0.0,2010
1,Albania,89,132,54,4.9,2010
2,Algeria,25,0,14,0.7,2010
3,Andorra,245,138,312,12.4,2010
4,Angola,217,57,45,5.9,2010
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,2010
189,Vietnam,111,2,1,2.0,2010
190,Yemen,6,0,0,0.1,2010
191,Zambia,32,19,4,2.5,2010
192,Zimbabwe,64,18,4,4.7,2010

In [6]:
drinks = drinks_df.loc[:, ['country', 'total_litres_of_pure_alcohol', 'year']]
drinks

         country  total_litres_of_pure_alcohol  year
0    Afghanistan                           0.0  2010
1        Albania                           4.9  2010
2        Algeria                           0.7  2010
3        Andorra                          12.4  2010
4         Angola                           5.9  2010
..           ...                           ...   ...
188    Venezuela                           7.7  2010
189      Vietnam                           2.0  2010
190        Yemen                           0.1  2010
191       Zambia                           2.5  2010
192     Zimbabwe                           4.7  2010

[193 rows x 3 columns]

In [7]:
drinks_data = drinks.set_index('country')
drinks_data

             total_litres_of_pure_alcohol  year
country
Afghanistan                           0.0  2010
Albania                               4.9  2010
Algeria                               0.7  2010
Andorra                              12.4  2010
Angola                                5.9  2010
...                                   ...   ...
Venezuela                             7.7  2010
Vietnam                               2.0  2010
Yemen                                 0.1  2010
Zambia                                2.5  2010
Zimbabwe                              4.7  2010

[193 rows x 2 columns]

In [8]:
drinks_data.dtypes

total_litres_of_pure_alcohol    float64
year                              int64
dtype: object